[NoCoverage] BlockStatement
src/middlewares/productValidation.js:3:47
 const { validateProduct } = require('./validations/validations');
 
-const productValidation = (req, res, next) => {
-  const error = validateProduct(req.body);
-
-  if (error) {
-    let statusCode = 500;
-    let errorMessage = 'An unknown validation error occurred';
-
-    if (error.message.includes('require')) {
-      statusCode = 400;
-      errorMessage = error.message;
-    } else if (error.message.includes('length')) {
-      statusCode = 422;
-      errorMessage = error.message;
-    }
-
-    return res.status(statusCode).json({ message: errorMessage });
-  }
-  next();
-};
+const productValidation = (req, res, next) => {};
 
 module.exports = {

[NoCoverage] BlockStatement
src/middlewares/productValidation.js:6:14
 const productValidation = (req, res, next) => {
   const error = validateProduct(req.body);
 
-  if (error) {
-    let statusCode = 500;
-    let errorMessage = 'An unknown validation error occurred';
-
-    if (error.message.includes('require')) {
-      statusCode = 400;
-      errorMessage = error.message;
-    } else if (error.message.includes('length')) {
-      statusCode = 422;
-      errorMessage = error.message;
-    }
-
-    return res.status(statusCode).json({ message: errorMessage });
-  }
+  if (error) {}
   next();
 };

[NoCoverage] ConditionalExpression
src/middlewares/productValidation.js:6:7
 const productValidation = (req, res, next) => {
   const error = validateProduct(req.body);
 
-  if (error) {
+  if (false) {
     let statusCode = 500;
     let errorMessage = 'An unknown validation error occurred';

[NoCoverage] ConditionalExpression
src/middlewares/productValidation.js:10:9
     let statusCode = 500;
     let errorMessage = 'An unknown validation error occurred';
 
-    if (error.message.includes('require')) {
+    if (true) {
       statusCode = 400;
       errorMessage = error.message;

[NoCoverage] BlockStatement
src/middlewares/productValidation.js:10:44
     let statusCode = 500;
     let errorMessage = 'An unknown validation error occurred';
 
-    if (error.message.includes('require')) {
-      statusCode = 400;
-      errorMessage = error.message;
-    } else if (error.message.includes('length')) {
+    if (error.message.includes('require')) {} else if (error.message.includes('length')) {
       statusCode = 422;
       errorMessage = error.message;

[NoCoverage] ConditionalExpression
src/middlewares/productValidation.js:13:16
     if (error.message.includes('require')) {
       statusCode = 400;
       errorMessage = error.message;
-    } else if (error.message.includes('length')) {
+    } else if (false) {
       statusCode = 422;
       errorMessage = error.message;

[NoCoverage] BlockStatement
src/middlewares/productValidation.js:13:50
     if (error.message.includes('require')) {
       statusCode = 400;
       errorMessage = error.message;
-    } else if (error.message.includes('length')) {
-      statusCode = 422;
-      errorMessage = error.message;
-    }
+    } else if (error.message.includes('length')) {}
 
     return res.status(statusCode).json({ message: errorMessage });
