[NoCoverage] BlockStatement
src/middlewares/saleValidation.js:3:44
 const { validateSale } = require('./validations/validations');
 
-const saleValidation = (req, res, next) => {
-  const sale = req.body;
-  const errors = sale.map(validateSale).filter(Boolean);
-  const requiredError = errors.find((error) => error.message.includes('required'));
-  const greaterError = errors.find((error) => error.message.includes('greater'));
-  if (requiredError) {
-    return res.status(400).json({ message: requiredError.message });
-  }
-  if (greaterError) {
-    return res.status(422).json({ message: greaterError.message });
-  }
-  next();
-};
+const saleValidation = (req, res, next) => {};
 
 module.exports = {

[NoCoverage] MethodExpression
src/middlewares/saleValidation.js:5:18
 
 const saleValidation = (req, res, next) => {
   const sale = req.body;
-  const errors = sale.map(validateSale).filter(Boolean);
+  const errors = sale.map(validateSale);
   const requiredError = errors.find((error) => error.message.includes('required'));
   const greaterError = errors.find((error) => error.message.includes('greater'));

[NoCoverage] BlockStatement
src/middlewares/saleValidation.js:8:22
   const errors = sale.map(validateSale).filter(Boolean);
   const requiredError = errors.find((error) => error.message.includes('required'));
   const greaterError = errors.find((error) => error.message.includes('greater'));
-  if (requiredError) {
-    return res.status(400).json({ message: requiredError.message });
-  }
+  if (requiredError) {}
   if (greaterError) {
     return res.status(422).json({ message: greaterError.message });

[NoCoverage] ConditionalExpression
src/middlewares/saleValidation.js:8:7
   const errors = sale.map(validateSale).filter(Boolean);
   const requiredError = errors.find((error) => error.message.includes('required'));
   const greaterError = errors.find((error) => error.message.includes('greater'));
-  if (requiredError) {
+  if (false) {
     return res.status(400).json({ message: requiredError.message });
   }

[NoCoverage] BlockStatement
src/middlewares/saleValidation.js:11:21
   if (requiredError) {
     return res.status(400).json({ message: requiredError.message });
   }
-  if (greaterError) {
-    return res.status(422).json({ message: greaterError.message });
-  }
+  if (greaterError) {}
   next();
 };

[NoCoverage] ConditionalExpression
src/middlewares/saleValidation.js:11:7
   if (requiredError) {
     return res.status(400).json({ message: requiredError.message });
   }
-  if (greaterError) {
+  if (false) {
     return res.status(422).json({ message: greaterError.message });
   }
