[NoCoverage] BlockStatement
src/middlewares/validations/validations.js:4:38
 const { productSchema } = require('./schema');
 const { saleSchema } = require('./schema');
 
-const validateProduct = (product) => {
-  const { error } = productSchema.validate(product);
-  if (error) return error; 
-  return false;
-};
+const validateProduct = (product) => {};
 
 const validateSale = (sale) => {

[NoCoverage] ConditionalExpression
src/middlewares/validations/validations.js:6:7
 
 const validateProduct = (product) => {
   const { error } = productSchema.validate(product);
-  if (error) return error; 
+  if (true) return error; 
   return false;
 };

[NoCoverage] ConditionalExpression
src/middlewares/validations/validations.js:6:7
 
 const validateProduct = (product) => {
   const { error } = productSchema.validate(product);
-  if (error) return error; 
+  if (false) return error; 
   return false;
 };

[NoCoverage] BooleanLiteral
src/middlewares/validations/validations.js:7:10
 const validateProduct = (product) => {
   const { error } = productSchema.validate(product);
   if (error) return error; 
-  return false;
+  return true;
 };
 

[NoCoverage] BlockStatement
src/middlewares/validations/validations.js:10:32
   return false;
 };
 
-const validateSale = (sale) => {
-  const { error } = saleSchema.validate(sale);
-  if (error) return error; 
-  return false;
-};
+const validateSale = (sale) => {};
 
 module.exports = {

[NoCoverage] ConditionalExpression
src/middlewares/validations/validations.js:12:7
 
 const validateSale = (sale) => {
   const { error } = saleSchema.validate(sale);
-  if (error) return error; 
+  if (false) return error; 
   return false;
 };

[NoCoverage] ConditionalExpression
src/middlewares/validations/validations.js:12:7
 
 const validateSale = (sale) => {
   const { error } = saleSchema.validate(sale);
-  if (error) return error; 
+  if (true) return error; 
   return false;
 };
