[Killed] BlockStatement
src/models/sales.model.js:3:33
 const connection = require('./connection');
 
-const getAllSales = async () => {
-  const QUERY = `SELECT sp.sale_id as saleId, 
-  sp.product_id as productId, 
-  sp.quantity, s.date
-  FROM sales_products sp
-  INNER JOIN sales s ON sp.sale_id = s.id`;
-  const [sales] = await connection.execute(QUERY);
-
-  return sales;
-};
+const getAllSales = async () => {};
 
 const getSalesById = async (id) => {
killedBy: Model of Sales Should return a list of sales
statusReason: expected undefined to be an array

[Killed] BlockStatement
src/models/sales.model.js:14:36
   return sales;
 };
 
-const getSalesById = async (id) => {
-  const QUERY = `SELECT s.date, 
-  sp.product_id as productId, sp.quantity
-  FROM sales_products sp
-  INNER JOIN sales s ON sp.sale_id = s.id
-  WHERE sp.sale_id = ?`;
-  const [sale] = await connection.execute(QUERY, [id]);
-  return sale;
-};
+const getSalesById = async (id) => {};
 
 const createSale = async (sale) => {
killedBy: Model of Sales Should return a sale by ID
statusReason: expected undefined to be an array

[NoCoverage] BlockStatement
src/models/sales.model.js:24:36
   return sale;
 };
 
-const createSale = async (sale) => {
-    const QUERY = 'INSERT INTO sales () VALUES ()';
-    const [result] = await connection.execute(QUERY, []);
-    const saleId = result.insertId;
-    const QUERY2 = 'INSERT INTO sales_products (sale_id, product_id, quantity) VALUES (?, ?, ?)';
-    const products = sale.map(async ({ productId, quantity }) => {
-      await connection.execute(QUERY2, [saleId, productId, quantity]);
-    });
-    await Promise.all(products);
-    return saleId;
-};
+const createSale = async (sale) => {};
 
 const deleteSale = async (id) => {

[NoCoverage] BlockStatement
src/models/sales.model.js:29:66
     const [result] = await connection.execute(QUERY, []);
     const saleId = result.insertId;
     const QUERY2 = 'INSERT INTO sales_products (sale_id, product_id, quantity) VALUES (?, ?, ?)';
-    const products = sale.map(async ({ productId, quantity }) => {
-      await connection.execute(QUERY2, [saleId, productId, quantity]);
-    });
+    const products = sale.map(async ({ productId, quantity }) => {});
     await Promise.all(products);
     return saleId;

[Killed] BlockStatement
src/models/sales.model.js:36:34
     return saleId;
 };
 
-const deleteSale = async (id) => {
-  const QUERY = 'DELETE FROM sales WHERE id = ?';
-  const [sale] = await connection.execute(QUERY, [id]);
-  return sale;
-};
+const deleteSale = async (id) => {};
 
 module.exports = {
killedBy: Model of Sales Should delete a sale by ID
statusReason: Cannot read properties of undefined (reading 'affectedRows')
