[Killed] BlockStatement
src/services/products.service.js:3:28
 const { productsModel } = require('../models');
 
-const getAll = async () => {
-  const products = await productsModel.getAll();
-
-  return { status: 'SUCCESSFUL', data: products };
-};
+const getAll = async () => {};
 
 const findById = async (id) => {
killedBy: Service of Products Should return a list of products
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/products.service.js:9:32
   return { status: 'SUCCESSFUL', data: products };
 };
 
-const findById = async (id) => {
-  const product = await productsModel.getById(id);
-
-  if (!product) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
-
-  return { status: 'SUCCESSFUL', data: product };
-};
+const findById = async (id) => {};
 
 const addProduct = async (name) => {
killedBy: Service of Products Should return an error when product is not found
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/services/products.service.js:12:7
 const findById = async (id) => {
   const product = await productsModel.getById(id);
 
-  if (!product) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
+  if (false) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
 
   return { status: 'SUCCESSFUL', data: product };
killedBy: Service of Products Should return an error when product is not found
statusReason: expected 'SUCCESSFUL' to equal 'NOT_FOUND'

[Killed] BlockStatement
src/services/products.service.js:12:17
 const findById = async (id) => {
   const product = await productsModel.getById(id);
 
-  if (!product) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
+  if (!product) {}
 
   return { status: 'SUCCESSFUL', data: product };
killedBy: Service of Products Should return an error when product is not found
statusReason: expected 'SUCCESSFUL' to equal 'NOT_FOUND'

[Killed] BlockStatement
src/services/products.service.js:17:36
   return { status: 'SUCCESSFUL', data: product };
 };
 
-const addProduct = async (name) => {
-  const insertId = await productsModel.addProduct(name);
-  const product = await productsModel.getById(insertId);
-  return { status: 'CREATED', data: product };
-};
+const addProduct = async (name) => {};
 
 const updateProduct = async (id, name) => {
killedBy: Service of Products Should return CREATED message
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/products.service.js:23:43
   return { status: 'CREATED', data: product };
 };
 
-const updateProduct = async (id, name) => {
-  const productExists = await productsModel.getById(id);
-  if (!productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
-  
-  const product = await productsModel.updateProduct(id, name);
-  return { status: 'SUCCESSFUL', data: product };
-};
+const updateProduct = async (id, name) => {};
 
 const deleteProduct = async (id) => {
killedBy: Service of Products Should update product
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BooleanLiteral
src/services/products.service.js:25:7
 
 const updateProduct = async (id, name) => {
   const productExists = await productsModel.getById(id);
-  if (!productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
+  if (productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
   
   const product = await productsModel.updateProduct(id, name);
killedBy: Service of Products Should update product
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Killed] ConditionalExpression
src/services/products.service.js:25:7
 
 const updateProduct = async (id, name) => {
   const productExists = await productsModel.getById(id);
-  if (!productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
+  if (true) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
   
   const product = await productsModel.updateProduct(id, name);
killedBy: Service of Products Should update product
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Killed] BlockStatement
src/services/products.service.js:31:37
   return { status: 'SUCCESSFUL', data: product };
 };
 
-const deleteProduct = async (id) => {
-  const productExists = await productsModel.getById(id);
-  if (!productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
-
-  await productsModel.deleteProduct(id);
-  return { status: 'DELETED', data: { message: 'Product deleted' } };
-};
+const deleteProduct = async (id) => {};
 
 module.exports = {
killedBy: Service of Products Should not delete sold out product
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/services/products.service.js:33:7
 
 const deleteProduct = async (id) => {
   const productExists = await productsModel.getById(id);
-  if (!productExists) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
+  if (false) { return { status: 'NOT_FOUND', data: { message: 'Product not found' } }; }
 
   await productsModel.deleteProduct(id);
killedBy: Service of Products Should not delete sold out product
statusReason: expected 'DELETED' to equal 'NOT_FOUND'
