[Killed] BlockStatement
src/services/sales.service.js:3:30
 const { salesModel, productsModel } = require('../models');
 
-const allSales = async () => {
-  const sales = await salesModel.getAllSales();
-  return { status: 'SUCCESSFUL', data: sales };
-};
+const allSales = async () => {};
 
 const salesById = async (saleId) => {
killedBy: Service of Sales Should return a list of sales
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/sales.service.js:8:37
   return { status: 'SUCCESSFUL', data: sales };
 };
 
-const salesById = async (saleId) => {
-  const sale = await salesModel.getSalesById(saleId);
-
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
-
-  return { status: 'SUCCESSFUL', data: sale };
-};
+const salesById = async (saleId) => {};
 
 const salesCreate = async (sale) => {
killedBy: Service of Sales Should return a sale by id
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/sales.service.js:11:21
 const salesById = async (saleId) => {
   const sale = await salesModel.getSalesById(saleId);
 
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
+  if (!sale.length) {}
 
   return { status: 'SUCCESSFUL', data: sale };
killedBy: Service of Sales Should return an error when sale is not found
statusReason: expected 'SUCCESSFUL' to equal 'NOT_FOUND'

[Killed] BooleanLiteral
src/services/sales.service.js:11:7
 const salesById = async (saleId) => {
   const sale = await salesModel.getSalesById(saleId);
 
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
+  if (sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
 
   return { status: 'SUCCESSFUL', data: sale };
killedBy: Service of Sales Should return a sale by id
statusReason: expected 'NOT_FOUND' to equal 'SUCCESSFUL'

[Killed] BlockStatement
src/services/sales.service.js:16:37
   return { status: 'SUCCESSFUL', data: sale };
 };
 
-const salesCreate = async (sale) => {
-  const products = sale.map(({ productId }) => productsModel.getById(productId));
-  const productsFound = await Promise.all(products);
-  if (productsFound.includes(undefined)) {
-    return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  }
-  const saleId = await salesModel.createSale(sale);
-  const sales = await salesModel.getSalesById(saleId);
-  const soldItem = {
-    id: saleId,
-    itemsSold: sales.map((item) => ({
-      productId: item.productId,
-      quantity: item.quantity,
-    })),
-  };
-  return { status: 'CREATED', data: soldItem };
-};
+const salesCreate = async (sale) => {};
 
 const salesDelete = async (saleId) => {
killedBy: Service of Sales Should create a sale
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/services/sales.service.js:19:7
 const salesCreate = async (sale) => {
   const products = sale.map(({ productId }) => productsModel.getById(productId));
   const productsFound = await Promise.all(products);
-  if (productsFound.includes(undefined)) {
+  if (true) {
     return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   }
killedBy: Service of Sales Should create a sale
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Survived] ConditionalExpression
src/services/sales.service.js:19:7
 const salesCreate = async (sale) => {
   const products = sale.map(({ productId }) => productsModel.getById(productId));
   const productsFound = await Promise.all(products);
-  if (productsFound.includes(undefined)) {
+  if (false) {
     return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   }

[Killed] BlockStatement
src/services/sales.service.js:34:39
   return { status: 'CREATED', data: soldItem };
 };
 
-const salesDelete = async (saleId) => {
-  const sale = await salesModel.getSalesById(saleId);
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
-
-  await salesModel.deleteSale(saleId);
-  return { status: 'DELETED', data: null };
-};
+const salesDelete = async (saleId) => {};
 
 module.exports = {
killedBy: Service of Sales Should delete a sale
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BooleanLiteral
src/services/sales.service.js:36:7
 
 const salesDelete = async (saleId) => {
   const sale = await salesModel.getSalesById(saleId);
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
+  if (sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
 
   await salesModel.deleteSale(saleId);
killedBy: Service of Sales Should delete a sale
statusReason: expected 'NOT_FOUND' to equal 'DELETED'

[Killed] ConditionalExpression
src/services/sales.service.js:36:7
 
 const salesDelete = async (saleId) => {
   const sale = await salesModel.getSalesById(saleId);
-  if (!sale.length) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
+  if (true) { return { status: 'NOT_FOUND', data: { message: 'Sale not found' } }; }
 
   await salesModel.deleteSale(saleId);
killedBy: Service of Sales Should delete a sale
statusReason: expected 'NOT_FOUND' to equal 'DELETED'
