[Killed] BlockStatement
src/controllers/products.controller.js:4:37
 const productService = require('../services/products.service');
 const mapStatusHTTP = require('../utils/mapStatusHTTP');
 
-const findAll = async (req, res) => {
-  const { status, data } = await productService.getAll();
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const findAll = async (req, res) => {};
 
 const getById = async (req, res) => {
killedBy: Controller of Products Should return a list of products
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:9:37
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const getById = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await productService.findById(id);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const getById = async (req, res) => {};
 
 const addProduct = async (req, res) => {
killedBy: Controller of Products Should return a product by id
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:16:40
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const addProduct = async (req, res) => {
-  const { name } = req.body;
-  const { status, data } = await productService.addProduct(name);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const addProduct = async (req, res) => {};
 
 const updateProduct = async (req, res) => {
killedBy: Controller of Products Should add a product
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:23:43
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const updateProduct = async (req, res) => {
-  const { id } = req.params;
-  const { name } = req.body;
-  const { status, data } = await productService.updateProduct(id, name);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const updateProduct = async (req, res) => {};
 
 const deleteProduct = async (req, res) => {
killedBy: Controller of Products Should update a product
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/products.controller.js:31:43
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const deleteProduct = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await productService.deleteProduct(id);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const deleteProduct = async (req, res) => {};
 
 module.exports = {
killedBy: Controller of Products Should delete a product
statusReason: expected stub to have been called with arguments 200
