[Killed] BlockStatement
src/controllers/sales.controller.js:4:48
 const salesServices = require('../services/sales.service');
 const mapStatusHTTP = require('../utils/mapStatusHTTP');
 
-const allSalesController = async (req, res) => {
-  const { status, data } = await salesServices.allSales();
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const allSalesController = async (req, res) => {};
 
 const salesByIdController = async (req, res) => {
killedBy: Controller of Sales Should return a list of sales
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sales.controller.js:9:49
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const salesByIdController = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await salesServices.salesById(id);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const salesByIdController = async (req, res) => {};
 
 const salesCreateController = async (req, res) => {
killedBy: Controller of Sales Should return sales by id
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/sales.controller.js:16:51
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const salesCreateController = async (req, res) => {
-  const sales = req.body;
-  const { status, data } = await salesServices.salesCreate(sales);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const salesCreateController = async (req, res) => {};
 
 const salesDeleteController = async (req, res) => {
killedBy: Controller of Sales Should add a new sale
statusReason: expected stub to have been called with arguments 201

[Killed] BlockStatement
src/controllers/sales.controller.js:23:51
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const salesDeleteController = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await salesServices.salesDelete(id);
-
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const salesDeleteController = async (req, res) => {};
 
 module.exports = {
killedBy: Controller of Sales Should delete a sale
statusReason: expected stub to have been called with arguments 204
