[Killed] BlockStatement
src/models/products.model.js:3:28
 const connection = require('./connection');
 
-const getAll = async () => {
-  const QUERY = 'SELECT * FROM products';
-  const [products] = await connection.execute(QUERY);
-
-  return products;
-};
+const getAll = async () => {};
 
 const getById = async (id) => {
killedBy: Model of Products Should return a list of products
statusReason: expected undefined to be an array

[Killed] BlockStatement
src/models/products.model.js:10:31
   return products;
 };
 
-const getById = async (id) => {
-  const QUERY = 'SELECT * FROM products WHERE id = ?';
-  const [[product]] = await connection.execute(QUERY, [id]);
-
-  return product;
-};
+const getById = async (id) => {};
 
 const addProduct = async (name) => {
killedBy: Model of Products Should return a product by ID
statusReason: expected undefined to be an object

[Killed] BlockStatement
src/models/products.model.js:17:36
   return product;
 };
 
-const addProduct = async (name) => {
-  const QUERY = 'INSERT INTO products (name) VALUE (?)';
-  const [{ insertId }] = await connection.execute(QUERY, [name]);
-  return insertId;
-};
+const addProduct = async (name) => {};
 
 const updateProduct = async (id, name) => {
killedBy: Model of Products Should test addProduct function from model
statusReason: expected undefined to be a number

[Killed] BlockStatement
src/models/products.model.js:23:43
   return insertId;
 };
 
-const updateProduct = async (id, name) => {
-  const QUERY = 'UPDATE products SET name = ? WHERE id = ?';
-  await connection.execute(QUERY, [name, id]);
-  const productUpdated = await getById(id);
-  return productUpdated;
-};
+const updateProduct = async (id, name) => {};
 
 const deleteProduct = async (id) => {
killedBy: Model of Products Should test updateProduct function from model
statusReason: expected undefined to be an object

[Killed] BlockStatement
src/models/products.model.js:30:37
   return productUpdated;
 };
 
-const deleteProduct = async (id) => {
-  const QUERY = 'DELETE FROM products WHERE id = ?';
-  const [productDeleted] = await connection.execute(QUERY, [id]);
-  return productDeleted;
-};
+const deleteProduct = async (id) => {};
 
 module.exports = {
killedBy: Model of Products Should delete a product by ID
statusReason: Cannot read properties of undefined (reading 'affectedRows')
