[Killed] ConditionalExpression
src/utils/mapStatusHTTP.js:11:35
     DELETED: 204,
 };
 
-const mapStatusHTTP = (status) => httpErrorMap[status] || 500;
+const mapStatusHTTP = (status) => true;
 
 module.exports = mapStatusHTTP;
killedBy: Controller of Products Should return a list of products
statusReason: expected status to have been called with arguments 200
true 200

[Killed] ConditionalExpression
src/utils/mapStatusHTTP.js:11:35
     DELETED: 204,
 };
 
-const mapStatusHTTP = (status) => httpErrorMap[status] || 500;
+const mapStatusHTTP = (status) => false;
 
 module.exports = mapStatusHTTP;
killedBy: Controller of Products Should return a list of products
statusReason: expected status to have been called with arguments 200
false 200
